
# ETL Banking Dataset
#### This notebook to read banking dataset then make some ETL process on it and add it as a table to database
we have json files (two) as new data and want to add this data into existing csv file (historical data) after some process on it and finally
save all this data into database

In [138]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import mysql.connector
from sqlalchemy import create_engine, text

In [91]:
# take a look in market capacity and exchange rate (existing data)
rates_df = pd.read_csv('exchange_rates.csv')
market_cap_df = pd.read_csv('market_cap.csv')
market_cap_df

     Market Cap (GBP$ Billion)                                     Name
0                      286.319                           JPMorgan Chase
1                      252.834  Industrial and Commercial Bank of China
2                      238.272                          Bank of America
3                      225.588                              Wells Fargo
4                      188.519                  China Construction Bank
..                         ...                                      ...
100                     27.826                             Ping An Bank
101                     27.332                       Standard Chartered
102                     25.728                     United Overseas Bank
103                     24.579                                QNB Group
104                     24.228                              Bank Rakyat

[105 rows x 2 columns]

## Extracting..

In [123]:
# create empty data frame and add json file on it (new data)
columns = ['name','market_capacity']
json_file1 = pd.read_json('bank_market_cap_1.json')
json_file2 = pd.read_json('bank_market_cap_2.json')
def extract():
    jsondf = pd.DataFrame(columns)
    jsondf = pd.concat([jsondf,json_file1])
    jsondf = pd.concat([jsondf,json_file2])
    return jsondf

# Transformation..
1. create log file to save each process
2. drop null values
3. check if column is not useful and drop it
4. change columns name and values to be same as csv (historical data)

In [95]:
import datetime
def log(message):
    now = datetime.datetime.now()
    cur_time = now.strftime('%Y-%h-%d-%H:%M:%S')
    #open file in append mode
    f = open("logfile.txt", "a")
    f.write(cur_time + ',' + message + '\n')
    f.close()

In [96]:
log('load phase is finished')
log('start transformation phase')

In [124]:
#add extraced data into final_data
final_data = extract()

# drop the 0 column
final_data.drop(0,inplace=True,axis=1)
# remove null value
final_data = final_data.dropna(subset=['Name'])

# print number of null
final_data.isnull().sum()
final_data

                                       Name  Market Cap (US$ Billion)
0                            JPMorgan Chase                   390.934
1   Industrial and Commercial Bank of China                   345.214
2                           Bank of America                   325.331
3                               Wells Fargo                   308.013
4                   China Construction Bank                   257.399
..                                      ...                       ...
65                             Ping An Bank                    37.993
66                       Standard Chartered                    37.319
67                     United Overseas Bank                    35.128
68                                QNB Group                    33.560
69                              Bank Rakyat                    33.081

[105 rows x 2 columns]

In [125]:
#get the exchange rate (convert from usd to gbp)
exchange_rate = rates_df[rates_df['Unnamed: 0']=='GBP']['Rates']

final_data['Market Cap (GBP$ Billion)'] = final_data['Market Cap (US$ Billion)'].apply(lambda x: x * exchange_rate+0.01)
final_data.drop('Market Cap (US$ Billion)', inplace=True, axis=1)

In [126]:
# change the columns order to be at the same order
cols = market_cap_df.columns.to_list()
newcols = [cols[1],cols[0]]
market_cap_df = market_cap_df.reindex(columns=newcols)

In [127]:
all_data = pd.concat([market_cap_df,final_data])
all_data
#log('transform phase is finished')

                                       Name  Market Cap (GBP$ Billion)
0                            JPMorgan Chase                 286.319000
1   Industrial and Commercial Bank of China                 252.834000
2                           Bank of America                 238.272000
3                               Wells Fargo                 225.588000
4                   China Construction Bank                 188.519000
..                                      ...                        ...
65                             Ping An Bank                  27.836013
66                       Standard Chartered                  27.342377
67                     United Overseas Bank                  25.737692
68                                QNB Group                  24.589291
69                              Bank Rakyat                  24.238472

[210 rows x 2 columns]

# Load...
Save data into csv file and load to sql.

In [130]:
#log('Load phase start')

In [132]:
# save the all_data file into new csv file
def load(loadTo,loadFile):
    loadFile.to_csv(loadTo, index=False)

In [133]:
#call function to load data
load('all_data.csv', all_data)

In [134]:
#log('Load phase finished')

In [139]:
allData = pd.read_csv('all_data.csv')
#create database engine
engine = create_engine('mysql+mysqlconnector://root:12345@localhost:3306/hospital_cancar')

#create bank table in database
allData.to_sql('bank', engine, index=False, if_exists='replace')

#create changerate table in database
rates_df.to_sql('changerate',engine, index=False, if_exists='replace')

-1

In [144]:

from subprocess import call
call(['python', '-m', 'nbconvert', 'etl_bank.ipynb'])

1